test_results/pgx/load/1.txt
     ✓ register | invalid payload | should return 400
     ✓ register | register with correct payload | should return 201
     ✓ register | register with correct payload | should return have a userId
     ✓ register | register with correct payload | should return have a nip
     ✓ register | register with correct payload | should return have a name
     ✓ register | register with correct payload | should return have an accessToken
     ✓ register | register with existing nip | should return 409
     ✗ login | login with correct payload | should return 200
      ↳  89% — ✓ 1667 / ✗ 193
     ✗ login | login with correct payload | should return have a userId
      ↳  89% — ✓ 1667 / ✗ 193
     ✗ login | login with correct payload | should return have a nip
      ↳  89% — ✓ 1667 / ✗ 193
     ✗ login | login with correct payload | should return have a name
      ↳  89% — ✓ 1667 / ✗ 193
     ✗ login | login with correct payload | should return have an accessToken
      ↳  89% — ✓ 1667 / ✗ 193
     ✓ nurse management post | register with correct payload | should return 201
     ✓ nurse management post | register with correct payload | should return have a userId
     ✓ nurse management post | register with correct payload | should return have a nip
     ✓ nurse management post | register with correct payload | should return have a name
     ✗ nurse management get | get all users | should return 200
      ↳  99% — ✓ 30730 / ✗ 2
     ✗ nurse management get | get all users | should all have a userId
      ↳  99% — ✓ 30730 / ✗ 2
     ✗ nurse management get | get all users | should all have a nip
      ↳  99% — ✓ 30730 / ✗ 2
     ✗ nurse management get | get all users | should all have a name
      ↳  99% — ✓ 30730 / ✗ 2
     ✗ nurse management get | get all users | should all have a createdAt
      ↳  99% — ✓ 30730 / ✗ 2
     ✗ nurse management get | get all users | should not have more than 5 result
      ↳  99% — ✓ 30730 / ✗ 2
     ✗ nurse management get | get all users | should have createdAt and format should be date
      ↳  99% — ✓ 30730 / ✗ 2
     ✗ nurse management get | get all users with name | should return 200
      ↳  99% — ✓ 30728 / ✗ 2
     ✗ nurse management get | get all users with name | should all have a userId
      ↳  99% — ✓ 30728 / ✗ 2
     ✗ nurse management get | get all users with name | should all have a nip
      ↳  99% — ✓ 30728 / ✗ 2
     ✗ nurse management get | get all users with name | should all have a name
      ↳  99% — ✓ 30728 / ✗ 2
     ✗ nurse management get | get all users with name | should all have a createdAt
      ↳  99% — ✓ 30728 / ✗ 2
     ✗ nurse management get | get all users with name | should not have more than 5 result
      ↳  99% — ✓ 30728 / ✗ 2
     ✗ nurse management get | get all users with name | should have createdAt and format should be date
      ↳  99% — ✓ 30728 / ✗ 2
     ✗ nurse management get | get all users with name | should have result with "a" in it
      ↳  99% — ✓ 30728 / ✗ 2
     ✗ nurse management get | get all users with nip | should return 200
      ↳  99% — ✓ 30726 / ✗ 2
     ✗ nurse management get | get all users with nip | should all have a userId
      ↳  99% — ✓ 30726 / ✗ 2
     ✗ nurse management get | get all users with nip | should all have a nip
      ↳  99% — ✓ 30726 / ✗ 2
     ✗ nurse management get | get all users with nip | should all have a name
      ↳  99% — ✓ 30726 / ✗ 2
     ✗ nurse management get | get all users with nip | should all have a createdAt
      ↳  99% — ✓ 30726 / ✗ 2
     ✗ nurse management get | get all users with nip | should not have more than 5 result
      ↳  99% — ✓ 30726 / ✗ 2
     ✗ nurse management get | get all users with nip | should have createdAt and format should be date
      ↳  99% — ✓ 30726 / ✗ 2
     ✗ nurse management get | get all users with nip | should have result with four digit of searched nip in it
      ↳  99% — ✓ 30726 / ✗ 2
     ✗ nurse management get | get all users with it role | should return 200
      ↳  99% — ✓ 30725 / ✗ 1
     ✗ nurse management get | get all users with it role | should all have a userId
      ↳  99% — ✓ 30725 / ✗ 1
     ✗ nurse management get | get all users with it role | should all have a nip
      ↳  99% — ✓ 30725 / ✗ 1
     ✗ nurse management get | get all users with it role | should all have a name
      ↳  99% — ✓ 30725 / ✗ 1
     ✗ nurse management get | get all users with it role | should all have a createdAt
      ↳  99% — ✓ 30725 / ✗ 1
     ✗ nurse management get | get all users with it role | should have createdAt and format should be date
      ↳  99% — ✓ 30725 / ✗ 1
     ✗ nurse management get | get all users with it role | should not have more than 5 result
      ↳  99% — ✓ 30725 / ✗ 1
     ✗ nurse management get | get all users with it role | should have all nip that starts with 615
      ↳  99% — ✓ 30725 / ✗ 1
     ✗ nurse management get | get all users with nurse role | should return 200
      ↳  99% — ✓ 30719 / ✗ 6
     ✗ nurse management get | get all users with nurse role | should all have a userId
      ↳  99% — ✓ 30719 / ✗ 6
     ✗ nurse management get | get all users with nurse role | should all have a nip
      ↳  99% — ✓ 30719 / ✗ 6
     ✗ nurse management get | get all users with nurse role | should all have a name
      ↳  99% — ✓ 30719 / ✗ 6
     ✗ nurse management get | get all users with nurse role | should all have a createdAt
      ↳  99% — ✓ 30719 / ✗ 6
     ✗ nurse management get | get all users with nurse role | should have createdAt and format should be date
      ↳  99% — ✓ 30719 / ✗ 6
     ✗ nurse management get | get all users with nurse role | should not have more than 5 result
      ↳  99% — ✓ 30719 / ✗ 6
     ✗ nurse management get | get all users with nurse role | should have all nip that starts with 303
      ↳  99% — ✓ 30719 / ✗ 6
     ✗ nurse management get | get all users with createdAt asc | should return 200
      ↳  99% — ✓ 30715 / ✗ 4
     ✗ nurse management get | get all users with createdAt asc | should all have a userId
      ↳  99% — ✓ 30715 / ✗ 4
     ✗ nurse management get | get all users with createdAt asc | should all have a nip
      ↳  99% — ✓ 30715 / ✗ 4
     ✗ nurse management get | get all users with createdAt asc | should all have a name
      ↳  99% — ✓ 30715 / ✗ 4
     ✗ nurse management get | get all users with createdAt asc | should all have a createdAt
      ↳  99% — ✓ 30715 / ✗ 4
     ✗ nurse management get | get all users with createdAt asc | should have createdAt and format should be date
      ↳  99% — ✓ 30715 / ✗ 4
     ✗ nurse management get | get all users with createdAt asc | should not have more than 5 result
      ↳  99% — ✓ 30715 / ✗ 4
     ✗ nurse management get | get all users with createdAt asc | should have return ordered by oldest first
      ↳  99% — ✓ 30715 / ✗ 4
     ✗ nurse management get | get all users with limit | should return 200
      ↳  99% — ✓ 30712 / ✗ 3
     ✗ nurse management get | get all users with limit | should all have a userId
      ↳  99% — ✓ 30712 / ✗ 3
     ✗ nurse management get | get all users with limit | should all have a nip
      ↳  99% — ✓ 30712 / ✗ 3
     ✗ nurse management get | get all users with limit | should all have a name
      ↳  99% — ✓ 30712 / ✗ 3
     ✗ nurse management get | get all users with limit | should all have a createdAt
      ↳  99% — ✓ 30712 / ✗ 3
     ✗ nurse management get | get all users with limit | should have createdAt and format should be date
      ↳  99% — ✓ 30712 / ✗ 3
     ✗ nurse management get | get all users with limit | should not have more than 2 result
      ↳  99% — ✓ 30712 / ✗ 3
     ✓ nurse management put | get all users with nurse role | should return 200
     ✓ nurse management put | get all users with it role | should return 200
     ✗ nurse management put | editing nurse | should return 200
      ↳  99% — ✓ 119 / ✗ 1
     ✓ nurse management put | get user by userId after edit | should return 200
     ✓ nurse management put | get user by userId after edit | should all have a userId
     ✗ nurse management put | get user by userId after edit | should have the same nip after edit
      ↳  99% — ✓ 119 / ✗ 1
     ✗ nurse management put | get user by userId after edit | should have the same name after edit
      ↳  99% — ✓ 119 / ✗ 1
     ✓ nurse management delete | get all users with nurse role | should return 200
     ✓ nurse management delete | get all users with it role | should return 200
     ✓ nurse management delete | no header | should return 401
     ✓ nurse management delete | no path value | should return 404
     ✓ nurse management delete | deleting an it | should return 404
     ✗ nurse management delete | deleting nurse | should return 200
      ↳  99% — ✓ 119 / ✗ 1
     ✓ nurse management delete | get user by userId after edit | should return 200
     ✓ nurse management delete | get user by userId after edit | should have no data
     ✓ nurse management access post | get all users with nurse role | should return 200
     ✓ nurse management access post | invalid payload | should return 400
     ✗ nurse management access post | give nurse access | should return 200
      ↳  95% — ✓ 212 / ✗ 9
     ✗ nurse management login | login with correct payload | should return 200
      ↳  83% — ✓ 1155 / ✗ 234
     ✗ image post |  | image post | correct file should return 200
      ↳  74% — ✓ 864 / ✗ 291
     ✗ image post |  | image post | correct file should have imageUrl
      ↳  74% — ✓ 864 / ✗ 291
     ✗ medical patient post | add medical patient | should return 201
      ↳  95% — ✓ 2101 / ✗ 94
     ✗ medical patient get | get all patient | should return 200
      ↳  99% — ✓ 3904 / ✗ 2
     ✗ medical patient get | get all patient | should all have a identityNumber
      ↳  99% — ✓ 3904 / ✗ 2
     ✗ medical patient get | get all patient | should all have phoneNumber
      ↳  99% — ✓ 3904 / ✗ 2
     ✗ medical patient get | get all patient | should all have a name
      ↳  99% — ✓ 3904 / ✗ 2
     ✗ medical patient get | get all patient | should have birthDate and format should be date
      ↳  99% — ✓ 3904 / ✗ 2
     ✗ medical patient get | get all patient | should all have gender
      ↳  99% — ✓ 3904 / ✗ 2
     ✗ medical patient get | get all patient | should all have a createdAt
      ↳  99% — ✓ 3904 / ✗ 2
     ✗ medical patient get | get all patient | should have createdAt and format should be date
      ↳  99% — ✓ 3904 / ✗ 2
     ✗ medical patient get | get all patient | should not have more than 5 result
      ↳  99% — ✓ 3904 / ✗ 2
     ✗ medical patient get | get all patient with name | should return 200
      ↳  99% — ✓ 3903 / ✗ 1
     ✗ medical patient get | get all patient with name | should all have a identityNumber
      ↳  99% — ✓ 3903 / ✗ 1
     ✗ medical patient get | get all patient with name | should all have phoneNumber
      ↳  99% — ✓ 3903 / ✗ 1
     ✗ medical patient get | get all patient with name | should all have a name
      ↳  99% — ✓ 3903 / ✗ 1
     ✗ medical patient get | get all patient with name | should have birthDate and format should be date
      ↳  99% — ✓ 3903 / ✗ 1
     ✗ medical patient get | get all patient with name | should all have gender
      ↳  99% — ✓ 3903 / ✗ 1
     ✗ medical patient get | get all patient with name | should all have a createdAt
      ↳  99% — ✓ 3903 / ✗ 1
     ✗ medical patient get | get all patient with name | should have createdAt and format should be date
      ↳  99% — ✓ 3903 / ✗ 1
     ✗ medical patient get | get all patient with name | should not have more than 5 result
      ↳  99% — ✓ 3903 / ✗ 1
     ✗ medical patient get | get all patient with name | should have result with "a" in it
      ↳  99% — ✓ 3903 / ✗ 1
     ✗ medical patient get | get all patient with phoneNumber | should return 200
      ↳  99% — ✓ 3900 / ✗ 3
     ✗ medical patient get | get all patient with phoneNumber | should all have a identityNumber
      ↳  99% — ✓ 3900 / ✗ 3
     ✗ medical patient get | get all patient with phoneNumber | should all have phoneNumber
      ↳  99% — ✓ 3900 / ✗ 3
     ✗ medical patient get | get all patient with phoneNumber | should all have a name
      ↳  99% — ✓ 3900 / ✗ 3
     ✗ medical patient get | get all patient with phoneNumber | should have birthDate and format should be date
      ↳  99% — ✓ 3900 / ✗ 3
     ✗ medical patient get | get all patient with phoneNumber | should all have gender
      ↳  99% — ✓ 3900 / ✗ 3
     ✗ medical patient get | get all patient with phoneNumber | should all have a createdAt
      ↳  99% — ✓ 3900 / ✗ 3
     ✗ medical patient get | get all patient with phoneNumber | should have createdAt and format should be date
      ↳  99% — ✓ 3900 / ✗ 3
     ✗ medical patient get | get all patient with phoneNumber | should not have more than 5 result
      ↳  99% — ✓ 3900 / ✗ 3
     ✗ medical patient get | get all patient with phoneNumber | should have result with four digit of searched phoneNumber in it
      ↳  99% — ✓ 3900 / ✗ 3
     ✗ medical patient get | get all patient with createdAt asc | should return 200
      ↳  99% — ✓ 3898 / ✗ 2
     ✗ medical patient get | get all patient with createdAt asc | should all have a identityNumber
      ↳  99% — ✓ 3898 / ✗ 2
     ✗ medical patient get | get all patient with createdAt asc | should all have phoneNumber
      ↳  99% — ✓ 3898 / ✗ 2
     ✗ medical patient get | get all patient with createdAt asc | should all have a name
      ↳  99% — ✓ 3898 / ✗ 2
     ✗ medical patient get | get all patient with createdAt asc | should have birthDate and format should be date
      ↳  99% — ✓ 3898 / ✗ 2
     ✗ medical patient get | get all patient with createdAt asc | should all have gender
      ↳  99% — ✓ 3898 / ✗ 2
     ✗ medical patient get | get all patient with createdAt asc | should all have a createdAt
      ↳  99% — ✓ 3898 / ✗ 2
     ✗ medical patient get | get all patient with createdAt asc | should have createdAt and format should be date
      ↳  99% — ✓ 3898 / ✗ 2
     ✗ medical patient get | get all patient with createdAt asc | should not have more than 5 result
      ↳  99% — ✓ 3898 / ✗ 2
     ✗ medical patient get | get all patient with createdAt asc | should have return ordered by oldest first
      ↳  99% — ✓ 3898 / ✗ 2
     ✗ medical patient get | get all patient with limit | should return 200
      ↳  99% — ✓ 3896 / ✗ 2
     ✗ medical patient get | get all patient with limit | should all have a identityNumber
      ↳  99% — ✓ 3896 / ✗ 2
     ✗ medical patient get | get all patient with limit | should all have phoneNumber
      ↳  99% — ✓ 3896 / ✗ 2
     ✗ medical patient get | get all patient with limit | should all have a name
      ↳  99% — ✓ 3896 / ✗ 2
     ✗ medical patient get | get all patient with limit | should have birthDate and format should be date
      ↳  99% — ✓ 3896 / ✗ 2
     ✗ medical patient get | get all patient with limit | should all have gender
      ↳  99% — ✓ 3896 / ✗ 2
     ✗ medical patient get | get all patient with limit | should all have a createdAt
      ↳  99% — ✓ 3896 / ✗ 2
     ✗ medical patient get | get all patient with limit | should have createdAt and format should be date
      ↳  99% — ✓ 3896 / ✗ 2
     ✗ medical patient get | get all patient with limit | should not have more than 2 result
      ↳  99% — ✓ 3896 / ✗ 2
     ✗ medical record post | get all patient | should return 200
      ↳  99% — ✓ 1438 / ✗ 11
     ✗ medical record post | add medical record | should return 201
      ↳  99% — ✓ 1431 / ✗ 4
     ✗ medical record get | get all record | should return 200
      ↳  98% — ✓ 2619 / ✗ 47
     ✗ medical record get | get all record | should all have a identityDetail
      ↳  98% — ✓ 2619 / ✗ 47
     ✗ medical record get | get all record | should all have a identityDetail.identityNumber
      ↳  98% — ✓ 2619 / ✗ 47
     ✗ medical record get | get all record | should all have a identityDetail.phoneNumber
      ↳  98% — ✓ 2619 / ✗ 47
     ✗ medical record get | get all record | should all have a identityDetail.name
      ↳  98% — ✓ 2619 / ✗ 47
     ✗ medical record get | get all record | should all have a identityDetail.birthDate and the format should be date
      ↳  98% — ✓ 2619 / ✗ 47
     ✗ medical record get | get all record | should all have a identityDetail.gender
      ↳  98% — ✓ 2619 / ✗ 47
     ✗ medical record get | get all record | should all have a identityDetail.identityCardScanImg
      ↳  98% — ✓ 2619 / ✗ 47
     ✗ medical record get | get all record | should all have a symptoms
      ↳  98% — ✓ 2619 / ✗ 47
     ✗ medical record get | get all record | should all have a medications
      ↳  98% — ✓ 2619 / ✗ 47
     ✗ medical record get | get all record | should all have a createdBy
      ↳  98% — ✓ 2619 / ✗ 47
     ✗ medical record get | get all record | should all have a createdBy.nip
      ↳  98% — ✓ 2619 / ✗ 47
     ✗ medical record get | get all record | should all have a createdBy.name
      ↳  98% — ✓ 2619 / ✗ 47
     ✗ medical record get | get all record | should all have a createdBy.userId
      ↳  98% — ✓ 2619 / ✗ 47
     ✗ medical record get | get all record | should have createdAt and format should be date
      ↳  98% — ✓ 2619 / ✗ 47
     ✗ medical record get | get all record | should not have more than 5 result
      ↳  98% — ✓ 2619 / ✗ 47
     ✗ medical record get | get all record with createdBy.userId | should return 200
      ↳  99% — ✓ 2599 / ✗ 20
     ✗ medical record get | get all record with createdBy.userId | should all have a identityDetail
      ↳  99% — ✓ 2599 / ✗ 20
     ✗ medical record get | get all record with createdBy.userId | should all have a identityDetail.identityNumber
      ↳  99% — ✓ 2599 / ✗ 20
     ✗ medical record get | get all record with createdBy.userId | should all have a identityDetail.phoneNumber
      ↳  99% — ✓ 2599 / ✗ 20
     ✗ medical record get | get all record with createdBy.userId | should all have a identityDetail.name
      ↳  99% — ✓ 2599 / ✗ 20
     ✗ medical record get | get all record with createdBy.userId | should all have a identityDetail.birthDate and the format should be date
      ↳  99% — ✓ 2599 / ✗ 20
     ✗ medical record get | get all record with createdBy.userId | should all have a identityDetail.gender
      ↳  99% — ✓ 2599 / ✗ 20
     ✗ medical record get | get all record with createdBy.userId | should all have a identityDetail.identityCardScanImg
      ↳  99% — ✓ 2599 / ✗ 20
     ✗ medical record get | get all record with createdBy.userId | should all have a symptoms
      ↳  99% — ✓ 2599 / ✗ 20
     ✗ medical record get | get all record with createdBy.userId | should all have a medications
      ↳  99% — ✓ 2599 / ✗ 20
     ✗ medical record get | get all record with createdBy.userId | should all have a createdBy
      ↳  99% — ✓ 2599 / ✗ 20
     ✗ medical record get | get all record with createdBy.userId | should all have a createdBy.name
      ↳  99% — ✓ 2599 / ✗ 20
     ✗ medical record get | get all record with createdBy.userId | should all have a createdBy.nip
      ↳  99% — ✓ 2599 / ✗ 20
     ✗ medical record get | get all record with createdBy.userId | should all have a createdBy.userId
      ↳  99% — ✓ 2599 / ✗ 20
     ✗ medical record get | get all record with createdBy.userId | should have createdAt and format should be date
      ↳  99% — ✓ 2599 / ✗ 20
     ✗ medical record get | get all record with createdBy.userId | should not have more than 5 result
      ↳  50% — ✓ 1321 / ✗ 1298
     ✗ medical record get | get all record with nip | should return 200
      ↳  98% — ✓ 2571 / ✗ 28
     ✗ medical record get | get all record with nip | should all have a identityDetail
      ↳  98% — ✓ 2571 / ✗ 28
     ✗ medical record get | get all record with nip | should all have a identityDetail.identityNumber
      ↳  98% — ✓ 2571 / ✗ 28
     ✗ medical record get | get all record with nip | should all have a identityDetail.phoneNumber
      ↳  98% — ✓ 2571 / ✗ 28
     ✗ medical record get | get all record with nip | should all have a identityDetail.name
      ↳  98% — ✓ 2571 / ✗ 28
     ✗ medical record get | get all record with nip | should all have a identityDetail.birthDate and the format should be date
      ↳  98% — ✓ 2571 / ✗ 28
     ✗ medical record get | get all record with nip | should all have a identityDetail.gender
      ↳  98% — ✓ 2571 / ✗ 28
     ✗ medical record get | get all record with nip | should all have a identityDetail.identityCardScanImg
      ↳  98% — ✓ 2571 / ✗ 28
     ✗ medical record get | get all record with nip | should all have a symptoms
      ↳  98% — ✓ 2571 / ✗ 28
     ✗ medical record get | get all record with nip | should all have a medications
      ↳  98% — ✓ 2571 / ✗ 28
     ✗ medical record get | get all record with nip | should all have a createdBy
      ↳  98% — ✓ 2571 / ✗ 28
     ✗ medical record get | get all record with nip | should all have a createdBy.name
      ↳  98% — ✓ 2571 / ✗ 28
     ✗ medical record get | get all record with nip | should all have a createdBy.nip
      ↳  98% — ✓ 2571 / ✗ 28
     ✗ medical record get | get all record with nip | should all have a createdBy.userId
      ↳  98% — ✓ 2571 / ✗ 28
     ✗ medical record get | get all record with nip | should have createdAt and format should be date
      ↳  98% — ✓ 2571 / ✗ 28
     ✗ medical record get | get all record with nip | should not have more than 5 result
      ↳  98% — ✓ 2571 / ✗ 28
     ✗ medical record get | get all record with createdAt asc | should return 200
      ↳  99% — ✓ 2556 / ✗ 15
     ✗ medical record get | get all record with createdAt asc | should all have a identityDetail
      ↳  99% — ✓ 2556 / ✗ 15
     ✗ medical record get | get all record with createdAt asc | should all have a identityDetail.identityNumber
      ↳  99% — ✓ 2556 / ✗ 15
     ✗ medical record get | get all record with createdAt asc | should all have a identityDetail.phoneNumber
      ↳  99% — ✓ 2556 / ✗ 15
     ✗ medical record get | get all record with createdAt asc | should all have a identityDetail.name
      ↳  99% — ✓ 2556 / ✗ 15
     ✗ medical record get | get all record with createdAt asc | should all have a identityDetail.birthDate and the format should be date
      ↳  99% — ✓ 2556 / ✗ 15
     ✗ medical record get | get all record with createdAt asc | should all have a identityDetail.gender
      ↳  99% — ✓ 2556 / ✗ 15
     ✗ medical record get | get all record with createdAt asc | should all have a identityDetail.identityCardScanImg
      ↳  99% — ✓ 2556 / ✗ 15
     ✗ medical record get | get all record with createdAt asc | should all have a symptoms
      ↳  99% — ✓ 2556 / ✗ 15
     ✗ medical record get | get all record with createdAt asc | should all have a medications
      ↳  99% — ✓ 2556 / ✗ 15
     ✗ medical record get | get all record with createdAt asc | should all have a createdBy
      ↳  99% — ✓ 2556 / ✗ 15
     ✗ medical record get | get all record with createdAt asc | should all have a createdBy.name
      ↳  99% — ✓ 2556 / ✗ 15
     ✗ medical record get | get all record with createdAt asc | should all have a createdBy.nip
      ↳  99% — ✓ 2556 / ✗ 15
     ✗ medical record get | get all record with createdAt asc | should all have a createdBy.userId
      ↳  99% — ✓ 2556 / ✗ 15
     ✗ medical record get | get all record with createdAt asc | should have createdAt and format should be date
      ↳  99% — ✓ 2556 / ✗ 15
     ✗ medical record get | get all record with createdAt asc | should not have more than 5 result
      ↳  99% — ✓ 2556 / ✗ 15
     ✗ medical record get | get all record with createdAt asc | should have return ordered by oldest first
      ↳  99% — ✓ 2556 / ✗ 15
     ✗ medical record get | get all record with limit | should return 200
      ↳  99% — ✓ 2552 / ✗ 4
     ✗ medical record get | get all record with limit | should all have a identityDetail
      ↳  99% — ✓ 2552 / ✗ 4
     ✗ medical record get | get all record with limit | should all have a identityDetail.identityNumber
      ↳  99% — ✓ 2552 / ✗ 4
     ✗ medical record get | get all record with limit | should all have a identityDetail.phoneNumber
      ↳  99% — ✓ 2552 / ✗ 4
     ✗ medical record get | get all record with limit | should all have a identityDetail.name
      ↳  99% — ✓ 2552 / ✗ 4
     ✗ medical record get | get all record with limit | should all have a identityDetail.birthDate and the format should be date
      ↳  99% — ✓ 2552 / ✗ 4
     ✗ medical record get | get all record with limit | should all have a identityDetail.gender
      ↳  99% — ✓ 2552 / ✗ 4
     ✗ medical record get | get all record with limit | should all have a identityDetail.identityCardScanImg
      ↳  99% — ✓ 2552 / ✗ 4
     ✗ medical record get | get all record with limit | should all have a symptoms
      ↳  99% — ✓ 2552 / ✗ 4
     ✗ medical record get | get all record with limit | should all have a medications
      ↳  99% — ✓ 2552 / ✗ 4
     ✗ medical record get | get all record with limit | should all have a createdBy
      ↳  99% — ✓ 2552 / ✗ 4
     ✗ medical record get | get all record with limit | should all have a createdBy.name
      ↳  99% — ✓ 2552 / ✗ 4
     ✗ medical record get | get all record with limit | should all have a createdBy.nip
      ↳  99% — ✓ 2552 / ✗ 4
     ✗ medical record get | get all record with limit | should all have a createdBy.userId
      ↳  99% — ✓ 2552 / ✗ 4
     ✗ medical record get | get all record with limit | should have createdAt and format should be date
      ↳  99% — ✓ 2552 / ✗ 4
     ✗ medical record get | get all record with limit | should not have more than 2 result
      ↳  99% — ✓ 2552 / ✗ 4
     ✓ image post |  | image post | post upload file empty auth should return 401
     ✓ image post |  | image post | post upload file empty file should return 400
     ✓ nurse management post | no header | should return 401
     ✓ nurse management post | no payload | should return 400
     ✓ nurse management post | invalid payload | should return 400
     ✓ nurse management put | no header | should return 401
     ✓ nurse management put | no path value | should return 404
     ✓ nurse management put | no payload | should return 400
     ✓ nurse management put | invalid payload | should return 400
     ✓ nurse management put | editing an it | should return 404
     ✓ nurse management put | edit with the existing nip | should return 409
     ✓ medical record post | no header | should return 401
     ✓ medical record post | no payload | should return 400
     ✓ medical record post | invalid payload | should return 400
     ✗ medical record post | not exists identity number | should return 404
      ↳  99% — ✓ 784 / ✗ 3
     ✓ medical record get | no header | should return 401
     ✓ login | invalid payload | should return 400
     ✓ login | not existing nip | should return 404
     ✓ medical patient post | no header | should return 401
     ✓ medical patient post | no payload | should return 400
     ✓ medical patient post | invalid payload | should return 400

     █ setup

       ✓ register | register with correct payload | should return 201
       ✓ register | register with correct payload | should return have a userId
       ✓ register | register with correct payload | should return have a nip
       ✓ register | register with correct payload | should return have a name
       ✓ register | register with correct payload | should return have an accessToken

     █ teardown

     checks.........................: 99.75% ✓ 2122412     ✗ 5274
     data_received..................: 288 MB 1.7 MB/s
     data_sent......................: 137 MB 827 kB/s
     grpc_req_duration..............: avg=24.69ms  min=116.78µs med=616.77µs max=5.41s    p(90)=8.98ms  p(95)=22.7ms
     http_req_blocked...............: avg=3.41µs   min=387ns    med=1.74µs   max=95.06ms  p(90)=3.24µs  p(95)=3.97µs
     http_req_connecting............: avg=895ns    min=0s       med=0s       max=95.01ms  p(90)=0s      p(95)=0s
     http_req_duration..............: avg=128.74ms min=81.13µs  med=597.81µs max=1m0s     p(90)=6.23ms  p(95)=13.74ms
       { expected_response:true }...: avg=39.51ms  min=213.27µs med=639.36µs max=40.72s   p(90)=6.72ms  p(95)=14.38ms
     http_req_failed................: 14.53% ✓ 44096       ✗ 259304
     http_req_receiving.............: avg=58.51µs  min=0s       med=29.87µs  max=160.85ms p(90)=61.7µs  p(95)=84.29µs
     http_req_sending...............: avg=15.06µs  min=2.54µs   med=9.54µs   max=48.83ms  p(90)=20.91µs p(95)=29.99µs
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s       p(90)=0s      p(95)=0s
     http_req_waiting...............: avg=128.67ms min=61.96µs  med=549.58µs max=1m0s     p(90)=6.12ms  p(95)=13.61ms
     http_reqs......................: 303400 1834.900643/s
     iteration_duration.............: avg=14.53s   min=104.97ms med=8.76s    max=1m31s    p(90)=1m0s    p(95)=1m0s
     iterations.....................: 1615   9.767187/s
     vus............................: 1003   min=5         max=1199
     vus_max........................: 1200   min=1200      max=1200


running (2m45.3s), 0000/1200 VUs, 1615 complete and 995 interrupted iterations
default ✓ [======================================] 0922/1200 VUs  2m15s
ulila@AzmiLL5Laptop:/dir/w3/HaloSusterTestCasesPSW3B2$